# Statistical Analysis of Data, Plus Data Cleaning

### Goals:

Use the pandas library to:

- Get summary info about a dataset and its variables
  - Apply and use `info`, `describe` and `dtype`
  - Use `mean`, `min`, `max`, and `value_counts` 
- Use `apply` and `applymap` to transform columns and create new values
- Explain `lambda` functions and use them to use an `apply` on a DataFrame
- Explain what a `groupby` object is and split a DataFrame using a `groupby`
- Reshape a DataFrame using `join`, `merge`, `pivot`, and `melt`
- Explore (and potentially, carefully, fill) null values using `is_na`/`is_null`
- Look for outliers and anomalies using `value_counts` and `describe`

## Data

Read about this dataset here: https://www.kaggle.com/ronitf/heart-disease-uci

![heart-data](heartbloodpres.jpeg)

The dataset is most often used to practice classification algorithms. Can one develop a model to predict the likelihood of heart disease based on other measurable characteristics? We will return to that specific question in a few weeks, but for now we wish to use the dataset to practice some pandas methods.

### 1. Get summary info about a dataset 

Applying and using `info`, `describe`, `mean`, `min`, `max`, `apply`, and `applymap` from the Pandas library

The Pandas library has several useful tools built in. Let's explore some of them.

In [1]:
!pwd
!ls

/c/Users/anupj/Documents/Courses/FlatironDS/Classes/Week1/data_cleaning_and_statistical_analysis-HTX_DS_111819
ds_chars.csv
heart.csv
heartbloodpres.jpeg
manipulating_data_with_pandas.ipynb
README.md
states.csv

In [2]:
import pandas as pd
uci_df = pd.read_csv('heart.csv')

In [7]:
uci_df.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

#### Attributes

In [4]:
uci_df.columns

Index(['age', 'sex', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'target'],
      dtype='object')

In [5]:
# Check the .shape method on our dataset. What do you observe?
uci_df.shape

(303, 14)

#### Methods

In [8]:
# Call the .info() method on our dataset. What do you observe?
uci_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.3 KB

In [9]:
# Use the code below. How does the output differ from info() ?
uci_df.dtypes

age           int64
sex           int64
cp            int64
trestbps      int64
chol          int64
fbs           int64
restecg       int64
thalach       int64
exang         int64
oldpeak     float64
slope         int64
ca            int64
thal          int64
target        int64
dtype: object

In [10]:
# Call the .describe() method on our dataset. What do you observe?
uci_df.describe()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
count,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000,303.000000
mean,54.366337,0.683168,0.966997,131.623762,246.264026,0.148515,0.528053,149.646865,0.326733,1.039604,1.399340,0.729373,2.313531,0.544554
std,9.082101,0.466011,1.032052,17.538143,51.830751,0.356198,0.525860,22.905161,0.469794,1.161075,0.616226,1.022606,0.612277,0.498835
min,29.000000,0.000000,0.000000,94.000000,126.000000,0.000000,0.000000,71.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,47.500000,0.000000,0.000000,120.000000,211.000000,0.000000,0.000000,133.500000,0.000000,0.000000,1.000000,0.000000,2.000000,0.000000
50%,55.000000,1.000000,1.000000,130.000000,240.000000,0.000000,1.000000,153.000000,0.000000,0.800000,1.000000,0.000000,2.000000,1.000000
75%,61.000000,1.000000,2.000000,140.000000,274.500000,0.000000,1.000000,166.000000,1.000000,1.600000,2.000000,1.000000,3.000000,1.000000
max,77.000000,1.000000,3.000000,200.000000,564.000000,1.000000,2.000000,202.000000,1.000000,6.200000,2.000000,4.000000,3.000000,1.000000

Using `describe` gives you a quick overview of each column's spread - by looking at the minimum value, maximum value, mean and standard deviation for each column, what kinds of trends or tendencies can you imagine that we could glean from this?

The methods `.mean()`, `.min()`, `.max()`, and `.sum()` will perform just the way you think they will!

Note that these are methods both for Series and for DataFrames.

In [12]:
uci_df.mean()

age          54.366337
sex           0.683168
cp            0.966997
trestbps    131.623762
chol        246.264026
fbs           0.148515
restecg       0.528053
thalach     149.646865
exang         0.326733
oldpeak       1.039604
slope         1.399340
ca            0.729373
thal          2.313531
target        0.544554
dtype: float64

In [14]:
#Let's check the rest of those methods 
uci_df.min()

age          29.0
sex           0.0
cp            0.0
trestbps     94.0
chol        126.0
fbs           0.0
restecg       0.0
thalach      71.0
exang         0.0
oldpeak       0.0
slope         0.0
ca            0.0
thal          0.0
target        0.0
dtype: float64

For a DataFrame _Series_, the `.value_counts()` method will tell you how many of each value you've got.

In [24]:
uci_df['age'].value_counts()[:10]

58    19
57    17
54    16
59    14
52    13
51    12
62    11
44    11
60    11
56    11
Name: age, dtype: int64

Checking the `value_counts` for a column can be a really useful way to find anomalous data, because you can see if you're getting 

Let's [check the documentation for `value_counts`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html) - what other arguments could we pass through that method that might be useful if we're looking for outliers or anomalies?

In [ ]:
# Pass other arguments through here

#### What are the different values for `restecg`?

In [26]:
# Your code here!
uci_df['restecg'].value_counts()[:10]

1    152
0    147
2      4
Name: restecg, dtype: int64

#### Null values

When checking the documentation, you may have noticed that `value_counts` by default won't check for nulls. To look for null values, typically shown in Pandas as `NaN` or not-a-number, you can use `.isna()` in a few different ways. We already saw one - `.info()` typically shows null values (although it won't do it by default if your dataframe is too big).

In [28]:
# Here is another way to check an entire dataframe for nulls
uci_df.isna().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

Will null values always show up as `NaN`s? Let's discuss.

### 2.  Changing data

#### DataFrame.applymap() and Series.map()

The ```.applymap()``` method takes a function as input that it will then apply to every entry in the dataframe.

In [29]:
# Originally looks like:
uci_df.head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1

In [30]:
# Defining a function to test this...
def add_one(x):
    return x + 1

In [31]:
# Look!
uci_df.applymap(add_one).head(10)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,64,2,4,146,234,2,1,151,1,3.3,1,1,2,2
1,38,2,3,131,251,1,2,188,1,4.5,1,1,3,2
2,42,1,2,131,205,1,1,173,1,2.4,3,1,3,2
3,57,2,2,121,237,1,2,179,1,1.8,3,1,3,2
4,58,1,1,121,355,1,2,164,2,1.6,3,1,3,2
5,58,2,1,141,193,1,2,149,1,1.4,2,1,2,2
6,57,1,2,141,295,1,1,154,1,2.3,2,1,3,2
7,45,2,2,121,264,1,2,174,1,1.0,3,1,4,2
8,53,2,3,173,200,2,2,163,1,1.5,3,1,4,2
9,58,2,3,151,169,1,2,175,1,2.6,3,1,3,2

The `.map()` method takes a function as input that it will then apply to every entry in the Series.

In [35]:
# Can you see how this is different from applymap?
uci_df['age'].map(add_one).tail()

298    58
299    46
300    69
301    58
302    58
Name: age, dtype: int64

#### Anonymous Functions (Lambda Abstraction)

Simple functions can be defined right in the function call. This is called 'lambda abstraction'; the function thus defined has no name and hence is "anonymous".

In [36]:
# Originally looks like:
uci_df['oldpeak'][:10]

0    2.3
1    3.5
2    1.4
3    0.8
4    0.6
5    0.4
6    1.3
7    0.0
8    0.5
9    1.6
Name: oldpeak, dtype: float64

In [37]:
# I like to read this as 'for each x in this series, df[column], round x'
uci_df['oldpeak'].map(lambda x: round(x))[:10]

0    2
1    4
2    1
3    1
4    1
5    0
6    1
7    0
8    0
9    2
Name: oldpeak, dtype: int64

#### Use an anonymous function to turn the entries in `age` to strings:

In [49]:
# Your code here!
uci_df['age'].map(lambda x: str(x))

0      63
1      37
2      41
3      56
4      57
       ..
298    57
299    45
300    68
301    57
302    57
Name: age, Length: 303, dtype: object

### Further Practice - Animal Shelter Data on Animal Outcomes

Let's take a moment to examine the [Austin Animal Center outcomes data set](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Outcomes/9t4d-g238/data). What kinds of questions can we ask this data and what kinds of information can we get back?

In pairs and as a class, let's generate ideas.

Before doing anything else let's use `.info()`, `.describe()`, `dtypes`, etc. - what observations can we make about the data?

In [45]:
# First, need to grab that data again
animal_df = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [46]:
animal_df.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A789027,Lennie,02/17/2019 11:44:00 AM,02/17/2019 11:44:00 AM,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,08/05/2014 04:59:00 PM,08/05/2014 04:59:00 PM,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby

In [47]:
# How does using describe on this df differ from using it on the uci df?
animal_df.describe()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
count,111600,76421,111600,111600,111600,111594,50806,111600,111596,111575,111600,111600
unique,99983,18182,91766,91766,6652,9,22,5,5,50,2501,579
top,A721033,Max,04/18/2016 12:00:00 AM,04/18/2016 12:00:00 AM,09/01/2015,Adoption,Partner,Dog,Neutered Male,1 year,Domestic Shorthair Mix,Black/White
freq,33,496,39,39,118,48708,27993,63144,39070,20141,30459,11685

In [53]:
animal_df.isna().sum()

Animal ID               0
Name                35179
DateTime                0
MonthYear               0
Date of Birth           0
Outcome Type            6
Outcome Subtype     60794
Animal Type             0
Sex upon Outcome        4
Age upon Outcome       25
Breed                   0
Color                   0
dtype: int64

Let's rename the columns to something a bit more code-friendly.

In [54]:
# Originally:
animal_df.columns

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [56]:
# Change the column names here - hint, use a list!
animal_df.columns = ['id', 'name', 'date_time','month_year','dob', 'outcome_type', 'outcome_subtype', 'animal_type', 'sex_upon_outcome', 'age_upon_outcome', 'breed', 'color']
animal_df.columns

Index(['id', 'name', 'date_time', 'month_year', 'dob', 'outcome_type',
       'outcome_subtype', 'animal_type', 'sex_upon_outcome',
       'age_upon_outcome', 'breed', 'color'],
      dtype='object')

What are the breed `value_counts`?

How about outcome counts for dogs?

_Hint_ <br>
Remember we did filtering in a previous lesson like this:<br>
`customer_df.loc[customer_df["state"]=='OR']`

In [58]:
# Your code here - check for breed value counts
animal_df['breed'].value_counts()

Domestic Shorthair Mix                     30459
Pit Bull Mix                                8131
Labrador Retriever Mix                      6414
Chihuahua Shorthair Mix                     6061
Domestic Shorthair                          3934
                                           ...
Australian Cattle Dog/Golden Retriever         1
Spanish Mastiff Mix                            1
Labrador Retriever/Irish Wolfhound             1
Doberman Pinsch/Rottweiler                     1
Labrador Retriever/Bernese Mountain Dog        1
Name: breed, Length: 2501, dtype: int64

In [59]:
# Your code here - check outcomes based on animal type to get dog outcomes
animal_df['outcome_type'].value_counts()

Adoption           48708
Transfer           33506
Return to Owner    19730
Euthanasia          7566
Died                1040
Rto-Adopt            516
Disposal             442
Missing               66
Relocate              20
Name: outcome_type, dtype: int64

### Datetime Objects

We want to get the average age of animals, but the age variable is a mess.

Use a `map` to help change the dates from strings to datetime objects. 

- First use `map` to grab only the first 10 characters of date
- Second,  we can use `to_datetime` to convert the remaining characters to a datetime object

[For further reading on datetime formats, go here](http://strftime.org/)

In [60]:
# How do we know that the original DateTime column isn't the right type?
animal_df.dtypes

id                  object
name                object
date_time           object
month_year          object
dob                 object
outcome_type        object
outcome_subtype     object
animal_type         object
sex_upon_outcome    object
age_upon_outcome    object
breed               object
color               object
dtype: object

In [61]:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A789027,Lennie,02/17/2019 11:44:00 AM,02/17/2019 11:44:00 AM,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,02/13/2016 05:59:00 PM,02/13/2016 05:59:00 PM,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,03/18/2014 11:47:00 AM,03/18/2014 11:47:00 AM,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,10/18/2014 06:52:00 PM,10/18/2014 06:52:00 PM,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,08/05/2014 04:59:00 PM,08/05/2014 04:59:00 PM,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby

In [62]:
# Can you parse out exactly what this code is doing, and why?
animal_df['month_year'] = pd.to_datetime(
    animal_df['month_year'].map(lambda x: x[:10]), format='%m/%d/%Y')

In [63]:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A789027,Lennie,02/17/2019 11:44:00 AM,2019-02-17,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,02/13/2016 05:59:00 PM,2016-02-13,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,03/18/2014 11:47:00 AM,2014-03-18,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,10/18/2014 06:52:00 PM,2014-10-18,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,08/05/2014 04:59:00 PM,2014-08-05,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby

In [68]:
# Can you parse out exactly what this code is doing, and why?
animal_df['date_time'] = pd.to_datetime(
    animal_df['date_time'], format='%m/%d/%Y %I:%M:%S %p')

In [69]:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,02/13/2017,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,10/08/2015,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,03/12/2014,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,08/01/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,06/03/2014,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby

Let's do the same to the 'date of birth' column:

In [70]:
# Your code here
animal_df['dob'] = pd.to_datetime(animal_df.dob, format = '%m/%d/%Y')

In [71]:
animal_df.head(10)

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,2014-06-03,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby
5,A684617,NaN,2014-07-27 09:00:00,2014-07-27,2012-07-26,Transfer,SCRP,Cat,Intact Female,2 years,Domestic Shorthair Mix,Black
6,A742354,Artemis,2017-01-22 11:56:00,2017-01-22,2010-01-20,Return to Owner,NaN,Cat,Neutered Male,7 years,Domestic Shorthair Mix,Blue/White
7,A681036,NaN,2014-06-11 17:11:00,2014-06-11,2014-06-09,Transfer,Partner,Cat,Intact Male,2 days,Domestic Shorthair Mix,Brown Tabby
8,A698049,Luigi,2015-03-16 14:50:00,2015-03-16,2014-06-05,Transfer,Partner,Cat,Spayed Female,9 months,Domestic Medium Hair Mix,Black/White
9,A789027,Lennie,2019-03-10 12:25:00,2019-03-10,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream

In [72]:
animal_df.dtypes

id                          object
name                        object
date_time           datetime64[ns]
month_year          datetime64[ns]
dob                 datetime64[ns]
outcome_type                object
outcome_subtype             object
animal_type                 object
sex_upon_outcome            object
age_upon_outcome            object
breed                       object
color                       object
dtype: object

Now, create a new variable `age_in_days` by subtracting `dob` from `date`:

In [73]:
# Your code here
animal_df['age_in_days'] = animal_df.month_year - animal_df.dob

In [74]:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age_in_days
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream,734 days
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,128 days
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6 days
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,78 days
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,2014-06-03,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,63 days

In [76]:
animal_df.dtypes

id                           object
name                         object
date_time            datetime64[ns]
month_year           datetime64[ns]
dob                  datetime64[ns]
outcome_type                 object
outcome_subtype              object
animal_type                  object
sex_upon_outcome             object
age_upon_outcome             object
breed                        object
color                        object
age_in_days         timedelta64[ns]
dtype: object

Use `map` again to convert `age_in_days` to `years_old` with the `lambda` function `x.days/365`

In [85]:
animal_df = animal_df.drop(columns = 'year_old')

In [86]:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age_in_days
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream,734 days
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,128 days
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6 days
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,78 days
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,2014-06-03,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,63 days

In [91]:
# Code code code

animal_df['years_old'] = animal_df['age_in_days'].map(lambda x: x.days/365)

In [92]:
# Time for a sanity check:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age_in_days,years_old
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream,734 days,2.010959
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,128 days,0.350685
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6 days,0.016438
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,78 days,0.213699
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,2014-06-03,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,63 days,0.172603

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [93]:
# What object type does this return?
uci_df.groupby('sex')

#### `.groups` and `.get_group()`

In [120]:
uci_df.groupby('sex').mean()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,55.677083,1.041667,133.083333,261.302083,0.12500,0.572917,151.125000,0.229167,0.876042,1.427083,0.552083,2.125000,0.750000
1,53.758454,0.932367,130.946860,239.289855,0.15942,0.507246,148.961353,0.371981,1.115459,1.386473,0.811594,2.400966,0.449275

In [115]:
uci_df.head(25)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
5,57,1,0,140,192,0,1,148,0,0.4,1,0,1,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
7,44,1,1,120,263,0,1,173,0,0.0,2,0,3,1
8,52,1,2,172,199,1,1,162,0,0.5,2,0,3,1
9,57,1,2,150,168,0,1,174,0,1.6,2,0,2,1
10,54,1,0,140,239,0,1,160,0,1.2,2,0,2,1
11,48,0,2,130,275,0,1,139,0,0.2,2,0,2,1
12,49,1,1,130,266,0,1,171,0,0.6,2,0,2,1
13,64,1,3,110,211,0,0,144,1,1.8,1,0,2,1
14,58,0,3,150,283,1,0,162,0,1.0,2,0,2,1
15,50,0,2,120,219,0,1,158,0,1.6,1,0,2,1
16,58,0,2,120,340,0,1,172,0,0.0,2,0,2,1
17,66,0,3,150,226,0,1,114,0,2.6,0,0,2,1
18,43,1,0,150,247,0,1,171,0,1.5,2,0,2,1
19,69,0,3,140,239,0,1,151,0,1.8,2,2,2,1
20,59,1,0,135,234,0,1,161,0,0.5,1,0,3,1
21,44,1,2,130,233,0,1,179,1,0.4,2,0,2,1
22,42,1,0,140,226,0,1,178,0,0.0,2,0,2,1
23,61,1,2,150,243,1,1,137,1,1.0,1,0,2,1
24,40,1,3,140,199,0,1,178,1,1.4,2,0,3,1

In [99]:
uci_df.groupby('sex').get_group(0).tail()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Aggregating

In [110]:
uci_df.groupby('sex').std()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,9.409396,0.972427,19.311119,65.088946,0.332455,0.557150,20.047969,0.422503,1.119844,0.593736,0.881026,0.441290,0.435286
1,8.883803,1.059064,16.658246,42.782392,0.366955,0.510754,24.130882,0.484505,1.174632,0.627378,1.074082,0.659949,0.498626

**Exercise:** Find the average cholesterol level for those with heart disease.

In [116]:
# Your code here!

uci_df.groupby('target')['chol'].mean()
#uci.groupby('target').get_group(0)['chol'].mean()

target
0    251.086957
1    242.230303
Name: chol, dtype: float64

### Apply to Animal Shelter Data

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

In [121]:
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age_in_days,years_old
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream,734 days,2.010959
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,128 days,0.350685
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6 days,0.016438
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,78 days,0.213699
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,2014-06-03,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,63 days,0.172603

In [122]:
# Your code here
animal_df.groupby('animal_type')['years_old'].mean()

animal_type
Bird         1.416343
Cat          1.453812
Dog          2.791920
Livestock    1.200967
Other        1.280627
Name: years_old, dtype: float64

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [125]:
# Your code here
animal_df['year'] = animal_df.month_year.map(lambda x: x.year)
animal_df['month'] = animal_df.month_year.map(lambda x: x.month)
animal_df.head()

,id,name,date_time,month_year,dob,outcome_type,outcome_subtype,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,age_in_days,years_old,year,month
0,A789027,Lennie,2019-02-17 11:44:00,2019-02-17,2017-02-13,Adoption,NaN,Dog,Neutered Male,2 years,Chihuahua Shorthair Mix,Cream,734 days,2.010959,2019,2
1,A720371,Moose,2016-02-13 17:59:00,2016-02-13,2015-10-08,Adoption,NaN,Dog,Neutered Male,4 months,Anatol Shepherd/Labrador Retriever,Buff,128 days,0.350685,2016,2
2,A674754,NaN,2014-03-18 11:47:00,2014-03-18,2014-03-12,Transfer,Partner,Cat,Intact Male,6 days,Domestic Shorthair Mix,Orange Tabby,6 days,0.016438,2014,3
3,A689724,*Donatello,2014-10-18 18:52:00,2014-10-18,2014-08-01,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,Black,78 days,0.213699,2014,10
4,A680969,*Zeus,2014-08-05 16:59:00,2014-08-05,2014-06-03,Adoption,NaN,Cat,Neutered Male,2 months,Domestic Shorthair Mix,White/Orange Tabby,63 days,0.172603,2014,8

In [128]:
animal_df.groupby('month').size()

month
1      7637
2      6882
3      8230
4      8208
5      9998
6     10888
7     11050
8     10451
9      9702
10    10994
11     9209
12     8351
dtype: int64

In [129]:
animal_df.groupby('year').size()

year
2013     4505
2014    18709
2015    18506
2016    17673
2017    17656
2018    16730
2019    17821
dtype: int64

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [130]:
uci_df.pivot(values = 'sex', columns = 'target').tail(10)

target    0   1
293     1.0 NaN
294     1.0 NaN
295     1.0 NaN
296     0.0 NaN
297     1.0 NaN
298     0.0 NaN
299     1.0 NaN
300     1.0 NaN
301     1.0 NaN
302     0.0 NaN

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

Really quick, let's use some tiny toy dataframes to show these techniques.

### `.join()`

In [131]:
# Creating toy dataframes - what should these look like on their own?
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns = ['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns = ['age', 'HP'])

In [134]:
toy1

   age   HP
0   63  142
1   33   47

In [135]:
toy3 = toy1.copy()
toy4 = toy2.copy()

In [141]:
toy3.join(toy4.set_index('age'), on = 'age', lsuffix = '_A', rsuffix = '_B' )

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

In [140]:
# What arguments are we passing into this function and why?
toy1.join(toy2.set_index('age'), on = 'age',
          lsuffix = '_A', rsuffix = '_B').head()

   age  HP_A  HP_B
0   63   142   100
1   33    47   200

### `.merge()`

In [142]:
people_df = pd.read_csv('ds_chars.csv', index_col = 0)
people_df.head()

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [143]:
states_df = pd.read_csv('states.csv', index_col = 0)
states_df.head()

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

In [145]:
# Let's break this down too, what arguments are we passing?
merged_df = people_df.merge(states_df, left_on='home_state', right_on='state',
                            how='inner')
merged_df

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

### `pd.concat()`

**Exercise:** Look up the documentation on [pd.concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and use it to concatenate ds_chars and states.

Your result should still have only five rows!

In [146]:
#Your code here

NameError: name 'df_chars' is not defined

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [147]:
pd.melt(merged_df, id_vars='HP')

     HP    variable       value
0   200        name        greg
1   200        name       miles
2   170        name        alan
3   200        name      rachel
4   300        name      alison
5   200  home_state          WA
6   200  home_state          WA
7   170  home_state          TX
8   200  home_state          TX
9   300  home_state          DC
10  200       state          WA
11  200       state          WA
12  170       state          TX
13  200       state          TX
14  300       state          DC
15  200    nickname   evergreen
16  200    nickname   evergreen
17  170    nickname       alamo
18  200    nickname       alamo
19  300    nickname    district
20  200     capital     Olympia
21  200     capital     Olympia
22  170     capital      Austin
23  200     capital      Austin
24  300     capital  Washington

## Keep it going! 

Up until now, we've only been working with the outcomes data on our Austin animals. Now, let's join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

You can download the Intake Dataset is here: https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

_Hints_ :

- import and clean the intake dataset first
    - drop everything but the intake date and the animal id
    - use apply/applymap/lambda to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new days_in_shelter variable
- create a new month_at_intake variable
- notice that some values in "days_in_shelter" column are NaN or values < 0 (remove these rows using the "<" operator and ~is.na())
- use group_by to get some interesting information about the dataset

Make sure to export and save your cleaned dataset. Use the notation `df.to_csv()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [ ]:
#code here